{"pages":[{"loc":"http://cpchang.github.io/pages/publication.html","text":"Journal Papers 2014 K.-Y. Yang, C.-P. Chang , T.-Y. Wu, W.-S. Wang, Y.-H. Lin, R.-B. Wu, \"Modeling and fast eye-diagram estimation of ringing effects on branch line,\" IEEE Trans. Compon. Packag. Manuf. Technol. , vol.4, no.4, pp.641-647, April 2014 IEEE Conference Papers 2014 C.-P. Chang , M.-K. Kang, T.-Y. Huang, K.-B. Wu, R.-B. Wu, \"A Novel Noise Mitigation Design for TSV-to-Device Coupling Using Power Distribution Network,\" in Electrical Performance of Electronic Packaging and Systems (EPEPS), 2014 IEEE 23rd Conference , Oct. 2014. W.-C. Chen, C.-P. Chang , M.-K. Kang, T.-Y. Huang, K.-B. Wu, R.-B. Wu, \"Artificial Neural Network Modeling for Extrinsic Capacitance of FinFET,\" in Electrical Performance of Electronic Packaging and Systems (EPEPS), 2014 IEEE 23rd Conference , Oct. 2014. 2013 K.-B. Wu, C.-B. Chang , M.-C. Wu, R.-B. Wu, \"Simplified Array Model of Vertical Interconnect in Through-Silicon-Via Application,\" in 2013 Asia-Pacific Radio Science Conference (AP-RASC) , Sep. 2013. C.-B. Chang , T.-Y. Huang, M.-C. Wu, R.-B. Wu, \"Inductance Modeling of TSV for time domain simulation,\" in 2013 Asia-Pacific Radio Science Conference (AP-RASC) , Sep. 2013. 2012 Y.-C. Tseng, C.-B. Chang , C.-K. Tang, C.-H. Cheng, Y.-C. Lu, K.-Y. Lin, T.-L. Wu, and R.-B. Wu, \"Design considerations for radio frequency 3DICs,\" in 2012 IEEE Electrical Design of Advanced Packaging and Systems Symposium (EDAPS) , 2012, pp. 197–200. IEEE Book C.-B. Chang , [A Detailed Explanation on Basic Electrical Science] , GreatBooks Co. Ltd., Aug. 2012, ISBN: 978-986-7015-86-0. (in Chinese) Link-zh","title":"Publication","tags":"pages"},{"loc":"http://cpchang.github.io/pages/resume.html","text":"Files PDF Research Interests Electrical Engineering Signal Integrity Power Integrity Electromagnetic Compatibility Optimization Linear Programming Nonlinear Programming Convex Optimization Computational Electromagnetic Finite Element Method (FEM) Boundary Element Method (BEM) Meshfree Method Education National Taiwan University (NTU) , Taipei, Taiwan Sep.2006 – Jun.2010, Bachelor of Science in Electrical Engineering Sep.2011 – Jun.2013, Master of Science in Communication Engineering Experience Research Assistant Period Jul.2013–Aug.2014 Company National Science Council(NSC) National Taiwan University(NTU) 1 Project 3D Transistors and 3D Interconnects for Advanced VLSI System Intern Period Jul.2012 – Sep.2012 Company Taiwan Semiconductor Manufacturing Company(TSMC) Research Assistant Period Jul.2011 – Aug.2013 Company National Taiwan University(NTU) 5 Projects 3D Transistors and 3D Interconnects for Advanced VLSI System Electrical Modeling and Design for TSV array in Wide IO Modeling, Simulation, and Design for TSV Interconnects & Substrate Noise Coupling in 3D IC Stacking Application Signal Integrity Analysis and Design in 3D IC Packaging Modeling of power-ground planes and optimization of decoupling capacitors Software Skills Simulation Tools ANSYS® High Frequency Structural Simulator HFSS ANSYS® Q3D Extractor Q3D Angilent Advanced Design System ADS Language Mathematica®, Matlab®, Python Open Message Passing Library Open MPI HTML5/CSS3/javascript VBScript","title":"Resume","tags":"pages"},{"loc":"http://cpchang.github.io/project/loop-of-zen-why-so-serious.html","text":"Why so serious? Somebody gave me a interesting puzzle game, Loop of Zen . After 10 hours of furstration, I simply decided to spend about an hour to develop a Matlab code to solve this game. Steps Pattern recoginition to identify the elements. Solve this problem by recursion or ILP . This code is uploaded to github . Pattern Recognition Solving Puzzles After have the right element pattern, we can solve this problem either by conventional recursion or Integer Linear Programming (ILP). The later solution had become a great practice of my recent lecture taken in Coursera. By the way, Linear and Integer Programming , https://www.coursera.org/course/linearprogramming was a great lecture given by professor Sriram Sankaranarayanan in University of Colorado Boulder. Method 1 - Recursion This might be the simplest, or orthodox, way to solve this problem. Fill all element with only 1 possible choice(singleton) Recurse over all possible choice for each element. Sample Code In file solveRecursion.m , it contains a recursing function called recursing , which will called itself recursively to solve this problem. This code is inspired by Sudoku Example of Matlab pages. Variables: E: element type R: rotation candidate s: first singleton e: element with no candidate(impossible puzzle) function [E,R,e] = recursing ( E,R ) [ Rc , s , e , J1 , J2 ] = candidate ( E , R ); if ~ isempty ( e ) return ; % Return for impossible puzzles. else while ~ isempty ( s ) % fill in singleton R ( s ) = Rc { s }; [ Rc , s , e , J1 , J2 ] = candidate ( E , R ); if ~ isempty ( e ) % Return for impossible puzzles. return ; end if showPuzzle showThisPuzzle ( E , R , J1 , J2 ); pause ( 0.01 ); end end end if any ( R (:) == 0 ) T = R ; % Temperary holder of R, since R is going into recursing z = find ( R (:) == 0 , 1 ); % The first unfilled cell. for ii = 1 : length ( Rc { z }) % Iterate over candidates. r = Rc { z }( ii ); R = T ; R ( z ) = r ; % Insert a tentative value. [ E , R ] = recursing ( E , R , showPuzzle ); % Recursive call. if all ( R (:) > 0 ) % Found a solution. return ; end end end end Method 2 - Integer Linear Programming A faster (and fancier) way to deal with this is to use ILP. The rescursive solution is actually the Branch and Bound in solving ILP, which branch all variables and create leaves. However, the ILP can actually solved faster by using cutting-plane method . $$x&#94;2+bx+c=\\infty$$ if (!document.getElementById('mathjaxscript_pelican_#%@#$@#')) { var mathjaxscript = document.createElement('script'); mathjaxscript.id = 'mathjaxscript_pelican_#%@#$@#'; mathjaxscript.type = 'text/javascript'; mathjaxscript.src = '//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML'; mathjaxscript[(window.opera ? \"innerHTML\" : \"text\")] = \"MathJax.Hub.Config({\" + \" config: ['MMLorHTML.js'],\" + \" TeX: { extensions: ['AMSmath.js','AMSsymbols.js','noErrors.js','noUndefined.js'], equationNumbers: { autoNumber: 'AMS' } },\" + \" jax: ['input/TeX','input/MathML','output/HTML-CSS'],\" + \" extensions: ['tex2jax.js','mml2jax.js','MathMenu.js','MathZoom.js'],\" + \" displayAlign: 'center',\" + \" displayIndent: '0em',\" + \" showMathMenu: true,\" + \" tex2jax: { \" + \" inlineMath: [ ['\\\\\\\\(','\\\\\\\\)'] ], \" + \" displayMath: [ ['$$','$$'] ],\" + \" processEscapes: true,\" + \" preview: 'TeX',\" + \" }, \" + \" 'HTML-CSS': { \" + \" styles: { '.MathJax_Display, .MathJax .mo, .MathJax .mi, .MathJax .mn': {color: 'black ! important'} }\" + \" } \" + \"}); \"; (document.body || document.getElementsByTagName('head')[0]).appendChild(mathjaxscript); }","title":"Loop of Zen - Why so Serious","tags":"project"},{"loc":"http://cpchang.github.io/project/capacitance-in-cylindrical-system.html","text":"Introduction In 3D-IC, the extraction of equivalent circuit of TSV (Through Silicon Vias) is the most fundamental part. However, hundreds of thousands of vias can take very long time to simulate. By utilizing the Multipole Boundary Element Method 1 , the analytic Green's function is given, without numerical integration. Meanwhile, the basis number can be dramatically reduced, and thus reduced the time for matrix inversion, which usually be the most time-consuming part in BEM. Result Charge Distribution in Homogeneous System One can easily shown the proximity effect between vias with the same or opposite polarity. Charge tends to crowd on the both side of vias with opposite polarity, while shrink away with the same one. Proximity Effect Shown in Potential Field and Electric Field Breakdown Frequency in 3D-IC Note that the thinner the isolation layer, the lower the breakdown frequency. Algorithm Efficiency Compare with commercial tool (FEM), we can observe that this method can *ignificantly reduce the computational complexity. (about 1sec for 144 TSVs ) Future Work T.B.D. Y. Liu, Fast Multipole Boundary Element Method: Theory and Applications in Engineering, 1st ed. Cambridge University Press, 2009 ↩","title":"Capacitance in Cylindrical System","tags":"project"},{"loc":"http://cpchang.github.io/project/welcome-to-my-site.html","text":"Short Bio Chang-Pao Chang received a B.S. degree in Electrical Engineering and Communications Engineering from National Taiwan University, Taipei, Taiwan, in 2010 and 2013, respectively. His current research interests include the modeling, design, and characterization of interconnection in IC, package, and printed circuit board.","title":"Welcome to My Site","tags":"project"}]}